/*用户环境分析对比图*/

/*
dataParam(params, ticket) {
  var text = "<center><b>" + params[0].name + "</center></b>";
  // var legendData = this.option.legend.data;
  var legendData = ['华东', '华北', '东北', '西北', '西南'];
  for (var i = 0; i < legendData.length; i++) {
    text = text + '----------' + legendData[i] + "----------<br/>";
    for (var j = 0; j < params.length; j++) {
      if (params[j].seriesName == legendData[i]) {
        // text = text + '&nbsp;&nbsp;&nbsp;&nbsp;' + this.option.series[params[j].seriesIndex].mc + ' : ' + params[j].data + "  V<br/>";
        text = text + '&nbsp;&nbsp;&nbsp;&nbsp;' + this.option.series[params[j].seriesIndex].mc + ' : ' + params[j].data + "  V<br/>";
      }
    }
  }
  return text;
}


option = {
  title: {
    text: '表箱昨日电压曲线',
    left: 'center'
  },
  tooltip: {
    trigger: 'axis',
    fontSize: 9,
  },
  // color: ["#EC870E",'f2e4d3', "#50A625", "#00A06B", "#57ceff", "#f2e4d3", "#e43#3c"],
  legend: {
    top: 25,
    data: ['华东', '华北', '东北', '西北', '西南']
  },
  grid: {
    left: '3%',
    right: '4%',
    bottom: '3%',
    containLabel: true
  },
  toolbox: {
    show: true,
    orient: 'vertical',
    x: 'right',
    y: 'center',
    feature: {
      dataView: {
        readOnly: false
      },
      magicType: {
        type: ['line', 'bar']
      },
      restore: {},
      saveAsImage: {}
    }
  },
  xAxis: {
    type: 'category',
    boundaryGap: false,
    data: ['00:00', '01:00', '02:00', '03:00', '04:00', '05:00', '06:00', '07:00', '08:00', '09:00', '10:00', '11:00', '12:00', '13:00', '14:00', '15:00', '16:00', '17:00', '18:00', '19:00', '20:00', '21:00', '22:00', '23:00'],
  },
  yAxis: [{
    type: 'value',
    axisLabel: {
      formatter: '{value}'
    },
    min: 200,
    max: 240
  }],
  dataZoom: [{
    type: 'inside',
    start: 0,
    end: 50
  }, {
    show: true,
    type: 'slider',
    y: '90%',
    start: 0,
    end: 50
  }],
  series: [{
    name: '华东',
    mc: '室内温度',
    type: 'line',
    smooth: true,
    // color:'#57ceff',
    data: [223.18, 223.44, 221.62, 222.48, 222.35, 224.56,
      223.32, 223.71, 222.77, 221.49, 224.79, 223.70, 221.33,
      222.35, 222.09, 224.42, 221.21, 224.76, 224.31, 224.99,
      221.54, 222.28, 224.07, 221.87
    ]
  },
    {
      name: '华东',
      mc: '室外温度',
      type: 'line',
      smooth: true,
      // color:'#f2e4d3',
      data: [216.71, 215.14, 223.03, 214.99, 215.00, 213.21,
        216.09, 217.38, 214.79, 218.46, 213.53, 212.81, 222.13,
        220.81, 222.62, 222.20, 220.61, 220.03, 218.32, 219.22,
        222.58, 220.81, 215.23, 219.47,
      ]
    },
    {
      name: '华北',
      mc: '表箱1',
      type: 'line',
      smooth: true,
      data: [215.32, 218.77, 215.74, 217.40, 213.07, 213.19,
        218.52, 219.17, 214.48, 217.04, 215.87, 214.27, 216.74,
        213.78, 213.25, 213.37, 214.10, 218.43, 214.30, 213.12,
        215.07, 215.22, 219.00, 216.89,
      ]
    },
    {
      name: '华北',
      mc: '表箱2',
      type: 'line',
      smooth: true,
      data: [220.72, 224.49, 222.29, 224.08, 223.73, 220.81,
        220.44, 223.04, 223.93, 224.00, 220.99, 220.79, 221.66,
        222.45, 220.48, 221.57, 222.39, 223.37, 222.53, 223.29,
        224.31, 220.97, 221.27, 223.26,
      ]
    },
    {
      name: '东北',
      mc: '表箱1',
      type: 'line',
      smooth: true,
      data: [224.48, 224.61, 223.55, 224.73, 223.46, 220.45,
        222.17, 221.28, 222.23, 222.62, 222.11, 220.87, 223.78,
        224.09, 224.62, 223.67, 220.63, 221.61, 224.23, 221.35,
        221.56, 224.04, 221.04, 224.50,
      ]
    },
    {
      name: '东北',
      mc: '表箱2',
      type: 'line',
      smooth: true,
      data: [221.47, 221.01, 222.18, 222.26, 224.72, 220.21,
        221.63, 224.82, 223.88, 224.80, 224.56, 223.14, 223.20,
        222.91, 221.51, 223.11, 224.42, 223.17, 220.94, 224.44,
        221.36, 224.88, 224.99, 221.47,
      ]
    },
    {
      name: '西北',
      mc: '表箱1',
      type: 'line',
      smooth: true,
      data: [224.48, 224.61, 223.55, 224.73, 223.46, 220.45,
        222.17, 221.28, 222.23, 222.62, 222.11, 220.87, 223.78,
        224.09, 224.62, 223.67, 220.63, 221.61, 224.23, 221.35,
        221.56, 224.04, 221.04, 224.50,
      ]
    },
    {
      name: '西北',
      mc: '表箱2',
      type: 'line',
      smooth: true,
      data: [221.47, 221.01, 222.18, 222.26, 224.72, 220.21,
        221.63, 224.82, 213.88, 214.80, 214.56, 223.14, 223.20,
        222.91, 221.51, 223.11, 224.42, 223.17, 220.94, 224.44,
        221.36, 224.88, 224.99, 221.47,
      ]
    },
    {
      name: '西南',
      mc: '表箱1',
      type: 'line',
      smooth: true,
      data: [224.48, 224.61, 223.55, 214.73, 223.46, 220.45,
        222.17, 221.28, 222.23, 222.62, 222.11, 220.87, 223.78,
        214.09, 214.62, 213.67, 220.63, 221.61, 224.23, 221.35,
        221.56, 224.04, 221.04, 214.50,
      ]
    },
    {
      name: '西南',
      mc: '表箱2',
      type: 'line',
      smooth: true,
      data: [211.47, 221.01, 212.18, 222.26, 224.72, 210.21,
        221.63, 224.82, 223.88, 224.80, 224.56, 223.14, 213.20,
        222.91, 211.51, 223.11, 224.42, 223.17, 220.94, 214.44,
        221.36, 214.88, 224.99, 221.47,
      ]
    },
  ]
}
*/
